Revit 2027 API
RebarContainerParameterManager.IsParameterOverridden Method
 Checks if the parameter has an override
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsParameterOverridden(
	ElementId paramId
)
Public Function IsParameterOverridden (
	paramId As ElementId
) As Boolean
public:
bool IsParameterOverridden(
	ElementId^ paramId
)
member IsParameterOverridden :
        paramId : ElementId -> bool
Parameters
paramId ElementId
 The id of the parameter element
Return Value
Boolean
 True if the parameter has an override
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
RebarContainerParameterManager Class
Autodesk.Revit.DB.Structure Namespace